/*************************************************************************
	> File Name: /home/gaoyu/euler/euler06-1.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月22日 星期日 10时05分54秒
 ************************************************************************/

#include<stdio.h>
int main () {
    int sum1 = (1 + 100) * 100 / 2;//等差公式：（a1 + an) * n / 2
    int sum2 = (2 * 100 * 100 * 100 + 3 * (1 + 100) * 100 -2 * 100) / 6;
        // 平方的和公式：(n * n * n) / 3 + (3 *(1 + n) * n) / 6 - n / 3 == (2 * n * n * n + 3 * (1 + n) * n - 2 * 100) / 6
    printf("%d\n", sum1 * sum1 - sum2);

    return 0;
}
