/*************************************************************************
	> File Name: euler31-1.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月28日 星期六 09时19分19秒
 ************************************************************************/

#include<stdio.h>
#define MAX_W 8
int d[MAX_W][201] = {0};//前n种钱凑齐钱数m有多少种方法
int w[MAX_W] = {1, 2, 5, 10, 20, 50, 100, 200};//钱数面值
int main () {
    for (int i = 0; i < 8; i++) {
        for (int j = 0; j < 201; j++) {
            if (j == 0) { //凑齐0元，需1种方法
                d[i][j] = 1;
                continue;
            }
            d[i][j] = 0;
            if (i - 1 >= 0)// 是否有前项
               d[i] [j] += d[i - 1][j];
            if (j - w[i] >= 0)  //需凑齐钱数小于所用的最大面值
               d[i][j] += d[i][j - w[i]];
        }
    }

    printf ("%d\n", d[7][200]);


    return 0;
}
