/*************************************************************************
	> File Name: euler25.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 10时08分33秒
 ************************************************************************/

#include<stdio.h>
int main () {
    int fib[3][1005] = {{0, 0}, {1, 1}, {1, 1}};
    int n = 2;
    while(fib[n % 3][0] < 1000) {
        n+=1;
        int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n -2) % 3];
        a[0] = b[0];
        for (int j = 1; j <= b[0]; j++) {
            a[j] = b[j] + c[j];

        }
        for (int j = 1; j <= a[0]; j++) {
            if (a[j] < 10) continue;
            a[j + 1] += a[j] / 10;
            a[j] %= 10;
            a[0] += (j == a[0]);
        }
        
    }

    printf("%d\n", n);

    return 0;
}
